Autodesk.Revit.DB.Revolution.Axis
Returns the Axis of the Revolution.
Remarks: This property is used to retrieve the Axis of the Revolution.

Autodesk.Revit.DB.Revolution.EndAngle
The end angle of the revolution relative to the sketch plane.
Remarks: The direction of the angle is based on the normal of the sketch plane.
A positive angle is on the same side as the normal, a negative angle on the opposite side.

Autodesk.Revit.DB.Revolution.StartAngle
The start angle of the revolution relative to the sketch plane.
Remarks: The direction of the angle is based on the normal of the sketch plane.
A positive angle is on the same side as the normal, a negative angle on the opposite side.

Autodesk.Revit.DB.Revolution.Sketch
Returns the Sketch of the Revolution.
Remarks: This property is used to retrieve the Sketch of the Revolution.

Autodesk.Revit.DB.Revolution
A revolution solid or void form.